# _*_ coding:UTF-8 _*_
# 开发人员: 理想国真恵玩-张大鹏
# 开发团队: 理想国真恵玩
# 开发时间: 2019/4/3 21:25
# 文件名称: hw_007_元组练习.py
# 开发工具: PyCharm

'''
Python 元组综合练习

使用python语言创建空元组 score，按学号顺序（由小到大）保存多个学生一门课程的
考试成绩。调用元组操作的常用函数实现以下功能：
1）创建score 元组，其中包含10 个数值（68,87,92,100,76,88,54,89,76,61）；
2）输出score 元组中第3个元素的数值；
3）输出score 元组中第1~6 个元素的值；
4）调用count()函数，查询数值76 在 score 元组中出现的次数；
5）调用index()函数，查询 score元组中成绩是满分的学生学号；
6）调用len()函数获得 score 元组中元素的个数；
7）调用list()函数将 score元组转换为lstScore 列表；
8）调用tuple()函数将 lstScore列表转换为tpScore 元组；
9）创建2个元组 score1和score2，score1中包含数值 2 个元素值：80,61，score2 中包含3
个元素值：71,95，82，合并这两个元组，并输出。
'''
