# _*_ coding:UTF-8 _*_
# 开发人员: 理想国真恵玩-张大鹏
# 开发团队: 理想国真恵玩
# 开发时间: 2019-04-14 12:08
# 文件名称: hw_005_format.py
# 开发工具: PyCharm

# 数字	格式	输出	描述
# 3.1415926	{:.2f}	3.14	保留小数点后两位
print('{:.2f}'.format(3.14159))
# 3.1415926	{:+.2f}	+3.14	带符号保留小数点后两位
print('{:+.2f}'.format(3.1415926))
# -1	{:+.2f}	-1.00	带符号保留小数点后两位
print('{:.2f}'.format(-1))
# 2.71828	{:.0f}	3	不带小数
print('{:.0f}'.format(2.71828))  # 四舍五入
print('{:.0f}'.format(2.11828))  # 四舍五入
# 5	{:0>2d}	05	数字补零 (填充左边, 宽度为2)
print('{:0>2d}'.format(5))
print('{:02d}'.format(5))
print('{:06d}'.format(5))  # 不要>也可以
# 5	{:x<4d}	5xxx	数字补x (填充右边, 宽度为4)
print('{:x<4d}'.format(5))  # 填充右边必须带<
# 10	{:x<4d}	10xx	数字补x (填充右边, 宽度为4)
print('{:x<4d}'.format(10))
# 1000000	{:,}	1,000,000	以逗号分隔的数字格式
print('{:,}'.format(10000000))
# 0.25	{:.2%}	25.00%	百分比格式
print('{:.2%}'.format(0.33))
print('{:.2%}'.format(0.333333))  # 只保留小数点后两位
# 1000000000	{:.2e}	1.00e+09	指数记法
print('{:.2e}'.format(1000000000000000))
# 13	{:10d}	        13	右对齐 (默认, 宽度为10)
print('{:10d}'.format(12))
# 13	{:<10d}	13	左对齐 (宽度为10)
print('{:<10d}'.format(33))
# 13	{:^10d}	    13	中间对齐 (宽度为10)
print('{:^10d}'.format(3))
print('{:^22s}'.format('很好'))
# 11
# '{:b}'.format(11)
print('{:b}'.format(11))  # 二进制表示
# '{:d}'.format(11)
print('{:d}'.format(11))  # 十进制表示
# '{:o}'.format(11)
print('--' * 22)
print('{:o}'.format(33))  # 八进制标志
print('{:o}'.format(9))  # 八进制标志

