# _*_ coding:UTF-8 _*_
# 开发人员: 理想国真恵玩-张大鹏
# 开发团队: 理想国真恵玩
# 开发时间: 2019-04-12 06:32
# 文件名称: hw_008_打印九九乘法表.py
# 开发工具: PyCharm

# 需求:打印如下九九乘法表
"""
1 x 1 = 1
1 x 2 = 2  2 x 2 = 4
......
"""
# 分析:总共有九行,每行数量列数量=所在行
# 思路:循环打印就行 每一行再循环打印 所在行的列

i = 0
while i < 9:
    i += 1
    # print(i)
    j = 0
    while j < i:
        j += 1
        print(j, end='\t')
    print()
print('--' * 22)
# 将以上形式替换为乘法表
i = 0
while i < 9:
    i += 1
    j = 0
    while j < i:
        j += 1
        print("%d x %d = %d" % (j, i, i * j), end='\t')
    print()
